{
 "recipe": {
  "name": "Masoor Dal",
  "safe_name": "Masoor_Dal",
  "yield_count": null,
  "yield_measure": null,
  "notes": "A recipe from Raj to go with some black mustard seeds he snuck me.This brown lentil when skinned and split in half becomes the bright, orange-colored masoor dal.  It is one of the quickest of all the dals to prepare.  I can be made from start to finish in less than a half hour.",
  "prep_time": null,
  "ingredients": {
   "ingredient": [
    {
     "quantity": "5 cups",
     "ingredient_name": "water",
     "preparation": null
    },
    {
     "quantity": "1 cup",
     "ingredient_name": "masoor dal (red lentils)",
     "preparation": "skinned"
    },
    {
     "quantity": "1 tsp",
     "ingredient_name": "salt",
     "preparation": null
    },
    {
     "quantity": "1/4 tsp",
     "ingredient_name": "tumeric",
     "preparation": null
    },
    {
     "quantity": "1/4 tsp",
     "ingredient_name": "cayenne pepper",
     "preparation": null
    },
    {
     "quantity": "1/4 tsp->1/2 tsp",
     "ingredient_name": "fresh chopped ginger",
     "preparation": null
    },
    {
     "quantity": "1/4 tsp",
     "ingredient_name": "coriander powder",
     "preparation": null
    },
    {
     "quantity": "1/4 tsp",
     "ingredient_name": "black mustard seeds",
     "preparation": null
    },
    {
     "quantity": "2 Tbl",
     "ingredient_name": "oil",
     "preparation": null
    },
    {
     "quantity": "1-2",
     "ingredient_name": "dried hot red chili",
     "preparation": null
    },
    {
     "quantity": "2 tsp",
     "ingredient_name": "lemon juice",
     "preparation": null
    },
    {
     "quantity": "1 Tbl",
     "ingredient_name": "fresh coriander",
     "preparation": null
    }
   ]
  },
  "preparation": "Wash the masoor dal in warm water and drain. [ It is important to thoroughly rinse the dal.  I do so in a smallish strainer, holding it in the sink running tepid water though it  directly from the faucet until the water runs pretty clear]  Bring 4 cups of water, to which the salt has been added, to a boil.  When the water begins to boil, add the cleaned and drained dal.  After the water begins to boil a second time let the dal cook uncovered for 5 minutes.   Then lower the heat to between medium and low and cover the pot.[I cook on \"low\" again to avoid a complete puree]Now cook the dal for 15 to 20 minutes until it is quite soft. [Preferring a less pureed dal I generally find 15 minutes more than sufficient] .  Then add 1 cup of water. [I don't add this cup of water ]  Stir again and add the turmeric, cayenne, cumin, finely chopped ginger and coridander.  Stir the dal with a spoon to mix in all the spices. Now transfer the mixture to large bowl, clean and dry the pot and return it to the stove.  [I add those spices to the original pot, stir and immediately re-cover]Add the cooked dal back into the pot.  This will cause a loud \"chuuum\" sound to be made.  Don't worry, this is the sign of an authentic Indian cook.  Cover the pot now and let the dal simmer for 2 minutes [No need to let it it simmer, just sit for 2 minutes off the flame] Then turn the heat off and stir in the fresh lemon juice.  This dal is now ready to be served.  Top the dal with fresh coriander leaves if you like.Serves Four to Six.[Always excellent over rice, though scooped by chapati or naan also great]",
  "primary_category": "Side",
  "secondary_categories": {
   "secondary_category": "**New06"
  },
  "untried": "1",
  "source_name": "Flavors of India, Shanta Nimbark Sacharoff",
  "entry_app": "Veronica",
  "cdate": "10/22/2010",
  "mdate": "10/22/2010",
  "user": "billp"
 }
}