{
 "recipe": {
  "source_page": null,
  "safe_name": "Steak_In_A_Bag",
  "primary_category": "Main Dishes",
  "preparation": "Egg breadcrumbs: use 3 to 4 slices of egg bread. If unable to find egg bread, use some equivalent dense country style bread. Tear bread, including crusts and ends, into pieces and place in blender or food processor fitted with the metal blade. Process until crumbly. Store extra crumbs in plastic bags in freezer and measure out as needed.Prepare egg breadcrumbs; set aside.   Remove excess fat from steak.In a small bowl, mix butter or margarine, oil, garlic, seasoned salt and seasoned pepper until blended. Spread on all sides of steak. Mix breadcrumbs and cheese. Press into butter mixture on steak, coating steak well.Open the supermarket bag and place it on its side. Slide in the steak. Fold the bag end over and staple it shut. Keep the bag on its side until serving. At this point the steak may be refrigerated for several hours.  Before cooking, bring steak to room temperature.Preheat oven to 375 degrees. Arrange the oven rack height so that the bag will not touch any heating elements as it gets quite oily and may be (Ed: IS!  IS! HUGELY!)  a fire hazard. Place bag on a rimmed baking sheet and bake 30 minutes. For a medium rare steak, increase oven temperature to 425 degrees and bake 15 minutes longer, a total of 45 minutes. For medium-well steak, reduce heat from 425 degrees to 375 degrees and bake 5 minutes longer before removing from oven, a total of 20 minutes. Remove steak from bag. Let stand 5 minutes before carving into thin slices. Makes 4 to 6 servings.   (easy to make, a good company dish. Don't lose any of the cheese coating; your guests will fight over it. Also reheats well.",
  "yield_count": "5",
  "yield_measure": "Servings",
  "cdate": "01/19/2005",
  "prep_time": null,
  "name": "Steak In A Bag",
  "secondary_categories": {
   "secondary_categorie": "Bill's Favorite"
  },
  "source_date": "1987",
  "source_name": "\"Cookery For Entertaining\", Marlene Sorosky, Hp Books, Tuscon",
  "notes": "The paper bag part always freaks people out.  Wonderfully tasty despite the monster fire hazard.  I think this is  an  \"Electric-Preferred\" kind of meal.  Be sure to have a chemical fire extinguisher on hand \"just in case\".",
  "ingredients": {
   "ingredient": [
    {
     "ingredient_name": "egg breadcrumbs",
     "quantity": "1 cup",
     "preparation": null
    },
    {
     "ingredient_name": "steak, 2.5\" thick",
     "quantity": "2-3 lbs",
     "preparation": null
    },
    {
     "ingredient_name": "vegetable oil",
     "quantity": "4 tbsp",
     "preparation": null
    },
    {
     "ingredient_name": "garlic",
     "quantity": "1 tsp",
     "preparation": "crushed"
    },
    {
     "ingredient_name": "seasoned salt",
     "quantity": "2 tsp",
     "preparation": null
    },
    {
     "ingredient_name": "seasoned pepper",
     "quantity": "2 1/2 tsp",
     "preparation": null
    },
    {
     "ingredient_name": "sharp cheddar cheese",
     "quantity": "1 cup",
     "preparation": "shredded"
    },
    {
     "ingredient_name": "butter",
     "quantity": "4 tbsp",
     "preparation": "softened"
    }
   ]
  },
  "mdate": null
 }
}