{
 "recipe": {
  "name": "English Muffins",
  "safe_name": "English_Muffins",
  "yield_count": null,
  "yield_measure": "Servings",
  "notes": "These make monstrously over-sized English muffins which are, I would opine, far superior to store bought.  The   resulting dough ends up somewhere between English muffins and Crumpets as far as the nooks and crannies go.",
  "prep_time": null,
  "ingredients": {
   "ingredient": [
    {
     "quantity": "2 1/4 cups",
     "ingredient_name": "unbleached bread flour",
     "preparation": null
    },
    {
     "quantity": "1/2 Tbl",
     "ingredient_name": "granulated sugar",
     "preparation": null
    },
    {
     "quantity": "3/4 tsp",
     "ingredient_name": "salt",
     "preparation": null
    },
    {
     "quantity": "1 1/4 tsp",
     "ingredient_name": "instant yeast",
     "preparation": null
    },
    {
     "quantity": "1 Tbl",
     "ingredient_name": "shortening or unsalted butter",
     "preparation": "at room temperature"
    },
    {
     "quantity": "1/2-1 cup",
     "ingredient_name": "milk or buttermilk",
     "preparation": "at room temperature"
    },
    {
     "quantity": null,
     "ingredient_name": "cornmeal",
     "preparation": "for dusting"
    }
   ]
  },
  "preparation": "Mix flour, sugar, salt and yeast in a large bowl.  With a sturdy spoon mix in the shortening and enough milk until the dough starts to form a ball -- about 3/4 cup.   The dough should be soft, pliable and not stiff.   Add in small portions of the milk if there are orphaned bits of flour still in the bowl.Sprinkle flour onto kneading surface and knead dough for about 10 minutes, until  smooth.  The dough may need a bit extra flour to remove any stickiness -- the dough should be tacky, but not sticky.  (not unlike the Author)Let the dough double at room temperature, an hour to an hour and a half.Divide the dough into 6 equal pieces of approximate 3 oz. each and shape into boules*.   On a cookie sheet, spread a layer of cornmeal over baking parchment and place the balls evenly on the sheet.  Mist the top with water or spray oil and lightly dust with cornmeal.  Wrap the tray loosely in  plastic wrap and proof at room temperature an hour to an hour and a half.Heat a skillet to medium height and preheat an oven to 350F.  Lightly oil the skillet with vegetable oil and place boules at least one inch apart on the griddle -- you'll probably have to cook in shifts.  Press the balls down with spatula as they cook 5-8 minutes or until they cannot cook any further without burning.  Repeat on flip side and immediately place in the oven for an additional 5-8 minutes.Allow muffins to cool at least 30 minutes on a rack before serving.*boule -- that's cookin' talk for ball-shaped.  The trick here is to pull the dough over itself and place the resulting ball seam-side down to maximize the appearance.  The easiest way to do this is to do the rough shaping by hand and then gradually turn the dough inside out.",
  "primary_category": "Breakfast",
  "secondary_categories": {
   "secondary_category": [
    "Buttermilk",
    "Apricot Jam",
    "Made For Butter",
    "Makes You Fat"
   ]
  },
  "source_name": "\"The Bread Baker's Apprentice\"",
  "entry_app": "Veronica",
  "cdate": "01/10/2005",
  "mdate": "11/11/2010",
  "user": "billp"
 }
}