{
 "recipe": {
  "source_page": null,
  "safe_name": "Grog",
  "primary_category": "Beverages",
  "preparation": "The simplest preparation is to pour 3/4 mug's worth of water, the lemon juice and sugar into a microwave-safe mug and heat in the microwave oven until near-boiling, then add the rum on top. This ensures that the restorative value of the alcohol is not burned off.Those who happen to have a tea kettle are encouraged to change the order of ingredients to be added: sugar first, lemon followed by rum with the hot water on top of that.Stir briskly.At some unknown point at the Golden Eagle House we started buying our way through the liquor department and came across \"Redrum\", a powerful rum-and-fruit fermentation offset nicely by lime juice and ever since the \"official House recipe\".",
  "yield_count": "1",
  "yield_measure": "mug",
  "cdate": "12/29/2004",
  "prep_time": "5-10 minutes",
  "name": "Grog",
  "secondary_categories": {
   "secondary_categorie": [
    "**New05",
    "Made For Butter"
   ]
  },
  "source_date": null,
  "source_name": "Unknown:  original inspiration believed to be from either \"Mr. Boston's\" or else \"Trader Vic's Bartender's Guide\"",
  "notes": "While we don't have the biting cold of what one would consider a \"real\" winter, we do suffer a bit of the deep, penetrating fog now and again here in the central valley.  Back in my college days I found that this was a heavenly treat both on nights when I could use some warming as well as some sound sleep.As legend has it, grog originated as a drink in the days of the sailing ships, where the ship's surgeon wanted to ensure everyone got a proper dose of vitamin C and, well, since they had to drink their rum portion in *some* way.",
  "ingredients": {
   "ingredient": [
    {
     "ingredient_name": "water",
     "quantity": "3/4 mug",
     "preparation": "boiling"
    },
    {
     "ingredient_name": "lemon or lime",
     "quantity": "1/2",
     "preparation": "juiced"
    },
    {
     "ingredient_name": "sugar",
     "quantity": "2 tbsp",
     "preparation": null
    },
    {
     "ingredient_name": "rum",
     "quantity": "2 oz",
     "preparation": null
    }
   ]
  },
  "mdate": "01/09/2005"
 }
}