{
 "recipe": {
  "name": "Hot Cross Buns",
  "preparation": "Sprinkle yeast over 1/2 cup lukewarm milk and let proof 10 minutes.Mix all dry ingredients except fruit together and add the fermented milk/yeast mixture.  Add butter, egg and yolk and mix thoroughly.  When the dough is solid enough to formMix dough thoroughly and knead dried fruit product into dough.  Lightly flour a large ziploc and seal dough inside until it doubles.Refrigerate overnight or up to 20 hours.This is where the original instructions get dodgy.  My transcription has it coming out \"an hour before you are to eat\" which sounds hinky, especially because it requires you do some subtractive math.  I think it should read \"Remove the dough from the fridge and let the chill off for 20 minutes.Punch down dough inside of bag to deflate.  Remove and divide into 10 pieces, rolling each into a ball.Place balls about 2 inches apart on a lined baking sheet and flatten slightly.Cover buns with a damp, clean dish towel and let rise in a warm place for about 40 minutes until nearly doubled in size.Using a razor blade or sharp knife, make a cross cut about 1/2 inch deep in the tops of the buns.Bake in a preheated 400-degree oven (375 for convections) for 12-15 minutes or until golden brown.While buns are baking, sift powdered sugar into a small bowl and add just enough milk to make a soft glaze.When buns are done, paint a cross of glaze along previous scores.  (PUNK ROCK NOTE: this glaze sounds like it would come out, well, lets say it rhymes with \"like fizz\".  Oldschool Sacto way is some kind of gooey-yet- rather-clear cookup). Serve as soon as possible.If baked ahead, the buns may be reheated in a 350F  oven for a few minutes.**Decent-sounding HCB recipes are somewhat hard to come by, in my experience.  The whole HCB culture seems blighted -- in some regions being all but completely unknown.  This Seems Wrong.",
  "main_ingredient": "Makes You Fat",
  "yield_count": "10",
  "notes": "**UNTRIED**  My Grams used to bring HCBs from some place in Sacto when I was growing up.  I have no idea where, but  they came in incredibly unwholesome tin pans.  I'd love to bust that out as kind of a retro touch, but it'll  need some experimenting.  Dough like this, thick and kinda elastic, refrigerates past the apocalypse.  It  would kick ass to be able to pull a pan of these out whenever.  Some of Andrew's family gifts stuff like  this and it is incredibly well received.Originally From SF Chronicle, 16 April 2003",
  "ingredients": {
   "ingredient": [
    {
     "ingredient_name": "Bread Flour",
     "unknown_1": "20083",
     "quantity": "2 Cups"
    },
    {
     "ingredient_name": "Light Brown Sugar",
     "unknown_1": "19334",
     "quantity": "2 Tbl"
    },
    {
     "ingredient_name": "Cinnamon",
     "unknown_1": "02010",
     "quantity": "1/4 Tsp"
    },
    {
     "ingredient_name": "Mace",
     "unknown_1": "02022",
     "quantity": "1/4 Tsp"
    },
    {
     "ingredient_name": "Cardamom",
     "quantity": "1/4 Tsp"
    },
    {
     "ingredient_name": "Ground Clove",
     "quantity": "Pinch"
    },
    {
     "ingredient_name": "Salt",
     "unknown_1": "02047",
     "quantity": "1/2 Tsp"
    },
    {
     "ingredient_name": "Unsalted Butter",
     "quantity": "2 Tbl",
     "preparation": "In Small Chunks"
    },
    {
     "ingredient_name": "Egg",
     "unknown_1": "01128",
     "quantity": "1"
    },
    {
     "ingredient_name": "Egg Yolk",
     "unknown_1": "01125",
     "quantity": "1"
    },
    {
     "ingredient_name": "Milk",
     "unknown_1": "01085",
     "quantity": "1/2 Cup"
    },
    {
     "ingredient_name": "Dry Yeast",
     "quantity": "1 1/2 Tsp"
    },
    {
     "ingredient_name": "Raisins",
     "unknown_1": "09298",
     "quantity": "1/2 Cup"
    },
    {
     "ingredient_name": "Powdered Sugar",
     "unknown_1": "19336",
     "quantity": "1 Cup"
    },
    {
     "ingredient_name": "Milk",
     "quantity": "2 Tbl",
     "preparation": "For Glaze"
    }
   ]
  },
  "category": {
   "category": [
    "Breakfast",
    "Untried"
   ]
  },
  "yield_measure": "Servings"
 }
}