{
 "recipe": {
  "main_ingredient": "Bill's Favorite",
  "notes": "There are some indications that this may have at one point come from my grandmother as the card  appeared to be in her hand,  but I always think of my mom making this recipe.  I've reformatted most of  these and redone the entries to be more readable, but since this is one of those close family recipes,I'll   leave it in the longhand form.",
  "ingredients": {
   "ingredient": [
    {
     "ingredient_name": "Ground Beef",
     "quantity": "1 Lb"
    },
    {
     "ingredient_name": "Sweet Italian Sausages",
     "quantity": "1 Lb"
    },
    {
     "ingredient_name": "Large Onions",
     "quantity": "2"
    },
    {
     "ingredient_name": "Garlic, Minced",
     "quantity": "1 Clove"
    },
    {
     "ingredient_name": "Tomatoes",
     "quantity": "1 Large Can"
    },
    {
     "ingredient_name": "Tomato Paste",
     "quantity": "1 Small Can"
    },
    {
     "ingredient_name": "Salt",
     "quantity": "2 Tsp"
    },
    {
     "ingredient_name": "Italian Herbs",
     "quantity": "2 Tsp"
    },
    {
     "ingredient_name": "Pepper",
     "quantity": "1/4 Tsp"
    },
    {
     "ingredient_name": "Lasagna Noodles",
     "quantity": "1 Pkg (1 Lb)"
    },
    {
     "ingredient_name": "Eggs",
     "quantity": "2"
    },
    {
     "ingredient_name": "Frozen, Chopped Spinach, Thawed",
     "quantity": "2 Pkg (10 Oz)"
    },
    {
     "ingredient_name": "Cottage Cheese",
     "quantity": "1 Lb Carton"
    },
    {
     "ingredient_name": "Grated Parmesan Cheese",
     "quantity": "1 Cup"
    },
    {
     "ingredient_name": "Sliced Mozzarella",
     "quantity": "12 Oz"
    }
   ]
  },
  "name": "Mom's Lasagna",
  "yield_measure": "Servings",
  "category": {
   "category": "Italian"
  },
  "preparation": "Brown ground beef and sausages in a large kettle, remove with a slotted spoon; reserve*.  Pour off all but 3 Tbl of the fat.  Saute onion and garlic in kettle until soft.  Return browned meat to kettle with tomatoes, salt, herbs and pepper.  Simmer over low heat, stirring several times for 30 minutes.  While sauce simmers, cook lasagna noodles,  following label directions; drain and place in a bowl of cold water to keep separated.  Beat eggs in a large bowl; add drained spinach, cottage cheese and remaining teaspoon of salt.  When ready to assemble: (d)rain noodles on paper toweling; arrange 3 strips on the bottom of each of two 13 x 9 x 2-inch baking dishes.  Spoon part of the cheese-spinach mixture over noodles; add part of meat sauce; sprinkle with grated Parmesan cheese.  Continue layering until all ingredients have been used.  Top each dish with slices of mozzarella cheese.  Bake in 350º oven 30 minutes or until bubbly-hot.  Garnish with sprigs of parsley, if you wish.   Lasagna can be assembled early and pulled from fridge an hour ahead of time.  Place cold lasagna in cold oven and heat to 350 and bake 1 hour.* the meat, not the fat -- cryptic family notation there."
 }
}